eisup_2019_docmng_integration/src/Documents/ttk_НастройкаПользовательскихПодписок/ttk_НастройкаПользовательскихПодписок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ttk_НастройкаПользовательскихПодписок</name>
  <posting>Deny</posting>
  <registerRecords>InformationRegister.ttk_ПользовательскиеПодпискиНаСобытия</registerRecords>
  <attributes>
    <name>ВидПодписки</name>
    <type>
      <types>CatalogRef.ttk_ВидыПользовательскихПодписок</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыводитьСписком</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Подписки</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПодразделениеОрганизации</name>
      <type>
        <types>CatalogRef.ПодразделенияОрганизаций</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

eisup_2019_docmng_integration/src/InformationRegisters/ttk_ПользовательскиеПодпискиНаСобытия/ttk_ПользовательскиеПодпискиНаСобытия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ttk_ПользовательскиеПодпискиНаСобытия</name>
  <writeMode>RecorderSubordinate</writeMode>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПодразделениеОрганизации</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидПодписки</name>
    <type>
      <types>CatalogRef.ttk_ВидыПользовательскихПодписок</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

eisup_2019_docmng_integration/src/Documents/ttk_НастройкаПользовательскихПодписок/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ЭтоНовый() Тогда
		ВыводитьСписком = Ложь;
		Подписки.Добавить();
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Движения.ttk_ПользовательскиеПодпискиНаСобытия.Записывать = Истина;
	Движения.ttk_ПользовательскиеПодпискиНаСобытия.Очистить();
	Для Каждого ТекСтрокаПодписки Из Подписки Цикл
		Движение = Движения.ttk_ПользовательскиеПодпискиНаСобытия.Добавить();
		Движение.ВидПодписки = ВидПодписки;
		Движение.Организация = Организация;
		Движение.Пользователь = ТекСтрокаПодписки.Пользователь;
		Движение.ПодразделениеОрганизации = ТекСтрокаПодписки.ПодразделениеОрганизации;		
	КонецЦикла;
	
КонецПроцедуры
